data/perf/sweep-apollo-f3deebfbab60/memcached-t112/memcached/tsan/run5/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        77816.86          ---          ---         9.69036         9.53500        20.99100        26.49500      5310.98 
Gets       778160.06       624.86    777535.19         8.99010         8.76700        20.09500        25.47100     19710.32 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     855976.92       624.86    777535.19         9.05376         8.83100        20.09500        25.59900     25021.30 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        73946.20          ---          ---        10.10687         9.91900        21.63100        27.13500      5046.81 
Gets       739453.87       382.64    739071.23         9.35989         9.08700        20.60700        26.11100     18717.16 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     813400.07       382.64    739071.23         9.42780         9.15100        20.73500        26.23900     23763.96 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        76547.07          ---          ---         9.81371         9.66300        21.24700        26.87900      5224.31 
Gets       765462.24       572.44    764889.80         9.09961         8.83100        20.35100        25.85500     19386.14 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     842009.31       572.44    764889.80         9.16453         8.89500        20.35100        25.98300     24610.46